; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_logistics_1)

(:domain logistics)

(:objects
	obj0 obj3 obj6 - airport
	obj1 obj4 obj7 - city
	obj2 - location
	obj5 obj11 obj14 obj16 - package
	obj8 obj9 obj12 obj13 - truck
	obj10 obj15 obj17 - airplane
)

(:init
	(at obj12 obj2)
	(at obj17 obj6)
	(at obj16 obj6)
	(in-city obj3 obj4)
	(in-city obj0 obj1)
	(in-city obj6 obj7)
	(at obj11 obj2)
	(at obj8 obj6)
	(at obj13 obj3)
	(at obj14 obj0)
	(at obj5 obj3)
	(at obj9 obj0)
	(at obj15 obj6)
	(in-city obj2 obj1)
	(at obj10 obj6)
)

(:goal (and
	(at obj11 obj0)
	(at obj14 obj3)
	(at obj16 obj3)
	(at obj5 obj0)
))
)

; plan
1. (fly obj17 obj6 obj3)
   deleted: (at obj17 obj6)
   added: (at obj17 obj3)
   goals met: 0 of 4
2. (load obj17 obj5 obj3)
   deleted: (at obj5 obj3)
   added: (in obj5 obj17)
   goals met: 0 of 4
3. (load obj15 obj16 obj6)
   deleted: (at obj16 obj6)
   added: (in obj16 obj15)
   goals met: 0 of 4
4. (load obj12 obj11 obj2)
   deleted: (at obj11 obj2)
   added: (in obj11 obj12)
   goals met: 0 of 4
5. (fly obj17 obj3 obj0)
   deleted: (at obj17 obj3)
   added: (at obj17 obj0)
   goals met: 0 of 4
6. (unload obj17 obj5 obj0)
   deleted: (in obj5 obj17)
   added: (at obj5 obj0)
   goals met: 1 of 4
7. (load obj17 obj14 obj0)
   deleted: (at obj14 obj0)
   added: (in obj14 obj17)
   goals met: 1 of 4
8. (fly obj17 obj0 obj3)
   deleted: (at obj17 obj0)
   added: (at obj17 obj3)
   goals met: 1 of 4
9. (unload obj17 obj14 obj3)
   deleted: (in obj14 obj17)
   added: (at obj14 obj3)
   goals met: 2 of 4
10. (fly obj15 obj6 obj3)
   deleted: (at obj15 obj6)
   added: (at obj15 obj3)
   goals met: 2 of 4
11. (unload obj15 obj16 obj3)
   deleted: (in obj16 obj15)
   added: (at obj16 obj3)
   goals met: 3 of 4
12. (drive obj12 obj2 obj0)
   deleted: (at obj12 obj2)
   added: (at obj12 obj0)
   goals met: 3 of 4
13. (unload obj12 obj11 obj0)
   deleted: (in obj11 obj12)
   added: (at obj11 obj0)
   goals met: 4 of 4
